In [70]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.metrics.pairwise import cosine_similarity
import warnings
warnings.filterwarnings("ignore")

In [71]:
data=pd.read_csv('movies.csv')
data.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [72]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9742 entries, 0 to 9741
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9742 non-null   int64
 1   title    9742 non-null   object
 2   genres   9742 non-null   object
dtypes: int64(1), object(2)
memory usage: 228.5+ KB

In [73]:
data.nunique()

movieId    9742
title      9737
genres      951
dtype: int64

In [74]:
data['title']=data.title.str.replace('(','').str.replace(')','').str.strip()
data.head()

,movieId,title,genres
0,1,Toy Story 1995,Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji 1995,Adventure|Children|Fantasy
2,3,Grumpier Old Men 1995,Comedy|Romance
3,4,Waiting to Exhale 1995,Comedy|Drama|Romance
4,5,Father of the Bride Part II 1995,Comedy

In [75]:
data['year']=data['title'].apply(lambda x: x[-4:])
         # or 
#data.title.str[-4:]
data.head()

,movieId,title,genres,year
0,1,Toy Story 1995,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji 1995,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men 1995,Comedy|Romance,1995
3,4,Waiting to Exhale 1995,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II 1995,Comedy,1995

In [76]:
data.year.unique()

array(['1995', '1994', '1996', '1976', '1992', '1967', '1993', '1964',
       '1977', '1965', '1982', '1990', '1991', '1989', '1937', '1940',
       '1969', '1981', '1973', '1970', '1955', '1959', '1968', '1988',
       '1997', '1972', '1943', '1952', '1951', '1957', '1961', '1958',
       '1954', '1934', '1944', '1960', '1963', '1942', '1941', '1953',
       '1939', '1950', '1946', '1945', '1938', '1947', '1935', '1936',
       '1956', '1949', '1932', '1975', '1974', '1971', '1979', '1987',
       '1986', '1980', '1978', '1985', '1966', '1962', '1983', '1984',
       '1948', '1933', '1931', '1922', '1998', '1929', '1930', '1927',
       '1928', '1999', '2000', '1926', '1919', '1921', '1925', '1923',
       '2001', '2002', '2003', '1920', '1915', '1924', '2004', '1916',
       '1917', '2005', '2006', '1902', 'on 5', '1903', '2007', '2008',
       '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016',
       '2017', '2018', '1908', ' One', 'Road', 'tson', 'mals', 'rson',
       'ight', 'e OA', 'smos', 'Baby', 'on 2', 'rror'], dtype=object)

In [77]:
# problem is that in some title names years are not present so to find that we use isdigit function

### isdigit() function in Python checks if a string contains only numeric digits (0-9).

        Returns True → if all characters in the string are digits (0-9).
        Returns False → if the string contains any non-digit character (letters, spaces, symbols, etc.).

In [78]:
data[data.year.str.isdigit()==False]   #because there are only few columns that does not contain years so we will drop that rows
# agar humare paad data jyada hota to hum yahan default years bhi put krr sakte the

,movieId,title,genres,year
6059,40697,Babylon 5,Sci-Fi,on 5
9031,140956,Ready Player One,Action|Sci-Fi|Thriller,One
9091,143410,Hyena Road,(no genres listed),Road
9138,147250,The Adventures of Sherlock Holmes and Doctor W...,(no genres listed),tson
9179,149334,Nocturnal Animals,Drama|Thriller,mals
9259,156605,Paterson,(no genres listed),rson
9367,162414,Moonlight,Drama,ight
9448,167570,The OA,(no genres listed),e OA
9514,171495,Cosmos,(no genres listed),smos
9515,171631,Maria Bamford: Old Baby,(no genres listed),Baby
9525,171891,Generation Iron 2,(no genres listed),on 2
9611,176601,Black Mirror,(no genres listed),rror

In [79]:
data=data[data.year.str.isdigit()==True] 
data

,movieId,title,genres,year
0,1,Toy Story 1995,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji 1995,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men 1995,Comedy|Romance,1995
3,4,Waiting to Exhale 1995,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II 1995,Comedy,1995
...,...,...,...,...
9737,193581,Black Butler: Book of the Atlantic 2017,Action|Animation|Comedy|Fantasy,2017
9738,193583,No Game No Life: Zero 2017,Animation|Comedy|Fantasy,2017
9739,193585,Flint 2017,Drama,2017
9740,193587,Bungo Stray Dogs: Dead Apple 2018,Action|Animation,2018
9741,193609,Andrew Dice Clay: Dice Rules 1991,Comedy,1991

In [80]:
data.year.unique()

array(['1995', '1994', '1996', '1976', '1992', '1967', '1993', '1964',
       '1977', '1965', '1982', '1990', '1991', '1989', '1937', '1940',
       '1969', '1981', '1973', '1970', '1955', '1959', '1968', '1988',
       '1997', '1972', '1943', '1952', '1951', '1957', '1961', '1958',
       '1954', '1934', '1944', '1960', '1963', '1942', '1941', '1953',
       '1939', '1950', '1946', '1945', '1938', '1947', '1935', '1936',
       '1956', '1949', '1932', '1975', '1974', '1971', '1979', '1987',
       '1986', '1980', '1978', '1985', '1966', '1962', '1983', '1984',
       '1948', '1933', '1931', '1922', '1998', '1929', '1930', '1927',
       '1928', '1999', '2000', '1926', '1919', '1921', '1925', '1923',
       '2001', '2002', '2003', '1920', '1915', '1924', '2004', '1916',
       '1917', '2005', '2006', '1902', '1903', '2007', '2008', '2009',
       '2010', '2011', '2012', '2013', '2014', '2015', '2016', '2017',
       '2018', '1908'], dtype=object)

In [81]:
data['title']=data['title'].apply(lambda x:x[:-5])
data

,movieId,title,genres,year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995
...,...,...,...,...
9737,193581,Black Butler: Book of the Atlantic,Action|Animation|Comedy|Fantasy,2017
9738,193583,No Game No Life: Zero,Animation|Comedy|Fantasy,2017
9739,193585,Flint,Drama,2017
9740,193587,Bungo Stray Dogs: Dead Apple,Action|Animation,2018
9741,193609,Andrew Dice Clay: Dice Rules,Comedy,1991

In [82]:
data['year']=data['year'].astype('int64')
data

,movieId,title,genres,year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995
...,...,...,...,...
9737,193581,Black Butler: Book of the Atlantic,Action|Animation|Comedy|Fantasy,2017
9738,193583,No Game No Life: Zero,Animation|Comedy|Fantasy,2017
9739,193585,Flint,Drama,2017
9740,193587,Bungo Stray Dogs: Dead Apple,Action|Animation,2018
9741,193609,Andrew Dice Clay: Dice Rules,Comedy,1991

In [83]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 9730 entries, 0 to 9741
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  9730 non-null   int64
 1   title    9730 non-null   object
 2   genres   9730 non-null   object
 3   year     9730 non-null   int64
dtypes: int64(2), object(2)
memory usage: 380.1+ KB

In [84]:
# now find unique genres  and apply one hot encoding to get features that are genres 
genres_list=list(data.genres.unique())
genres_list[:5]

['Adventure|Animation|Children|Comedy|Fantasy',
 'Adventure|Children|Fantasy',
 'Comedy|Romance',
 'Comedy|Drama|Romance',
 'Comedy']

In [85]:
unique_genres=set()
for i in genres_list:
    unique_genres.update(i.split('|'))
     
print(sorted(unique_genres))

['(no genres listed)', 'Action', 'Adventure', 'Animation', 'Children', 'Comedy', 'Crime', 'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 'Horror', 'IMAX', 'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']

In [86]:
#convert unique geners to list because set is not mutable 
unique_genres=list(unique_genres)
type(unique_genres)

list

In [87]:
   # or  
unique_genres=[]
 
for i in genres_list:
    li=i.split('|')
    
    for j in li:
        if j not in unique_genres:
            unique_genres.append(j)
print(unique_genres)

# we use it because set is not mutable

['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy', 'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror', 'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX', 'Western', 'Film-Noir', '(no genres listed)']

In [88]:
data[data.genres=='(no genres listed)'].shape

(26, 4)

In [89]:
df=data[data.genres!='(no genres listed)'] 
df.reset_index(drop=True,inplace=True)

In [90]:
df  # now we got preocessed data and it is ready to precess for content based filtering

,movieId,title,genres,year
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995
1,2,Jumanji,Adventure|Children|Fantasy,1995
2,3,Grumpier Old Men,Comedy|Romance,1995
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995
4,5,Father of the Bride Part II,Comedy,1995
...,...,...,...,...
9699,193581,Black Butler: Book of the Atlantic,Action|Animation|Comedy|Fantasy,2017
9700,193583,No Game No Life: Zero,Animation|Comedy|Fantasy,2017
9701,193585,Flint,Drama,2017
9702,193587,Bungo Stray Dogs: Dead Apple,Action|Animation,2018
9703,193609,Andrew Dice Clay: Dice Rules,Comedy,1991

In [91]:
unique_genres.remove('(no genres listed)')
print(unique_genres)

['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy', 'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror', 'Mystery', 'Sci-Fi', 'War', 'Musical', 'Documentary', 'IMAX', 'Western', 'Film-Noir']

In [92]:
#this is like a base to fill the genre values for final_df so let go ahed  
genres_df=pd.get_dummies(unique_genres).astype('int64')
genres_df

,Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
1,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
2,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0
5,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0
6,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0
7,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0
8,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0
9,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0
10,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0
11,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0
12,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0
13,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0
14,0,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0
15,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0,0
16,0,0,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0
17,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1
18,0,0,0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0

In [93]:
genres_df=genres_df[genres_df.index==0]
genres_df        

# this step is mostly used of keeping a single row

,Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

In [94]:
genres_df['Adventure']=0
genres_df

,Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0

In [95]:
df2=pd.concat([df,genres_df],axis=1)
df2.head()

,movieId,title,genres,year,Action,Adventure,Animation,Children,Comedy,Crime,...,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji,Adventure|Children|Fantasy,1995,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,3,Grumpier Old Men,Comedy|Romance,1995,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,5,Father of the Bride Part II,Comedy,1995,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [96]:
df2.fillna(0,inplace=True)
df2.head()       

# we do that stuff to get all values 0 so we will add new values to it

,movieId,title,genres,year,Action,Adventure,Animation,Children,Comedy,Crime,...,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji,Adventure|Children|Fantasy,1995,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men,Comedy|Romance,1995,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II,Comedy,1995,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

####  keep attention on next line

In [101]:
# before apply it we have to understand the next cell 

def create_encoding(tmp_df):
    genre_l = tmp_df['genres']   # generally it returns a series but we will apply the function row wise it 
    #print(genre_l)
    genre_l = genre_l.split('|')
    #print(genre_l)
    for g in genre_l:
        tmp_df[g]=1
        #display(tmp_df)
    return tmp_df

In [102]:
final_df = df2.apply(lambda x: create_encoding(x),axis=1)     # axis=1 means apply function to each row of genre column.
#Here, x is each row (a Pandas Series).
#create_encoding(x) is called on one row at a time, meaning x['genres'] is a string.
final_df.head()

,movieId,title,genres,year,Action,Adventure,Animation,Children,Comedy,Crime,...,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story,Adventure|Animation|Children|Comedy|Fantasy,1995,0.0,1.0,1.0,1.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,Jumanji,Adventure|Children|Fantasy,1995,0.0,1.0,0.0,1.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,Grumpier Old Men,Comedy|Romance,1995,0.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,4,Waiting to Exhale,Comedy|Drama|Romance,1995,0.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
4,5,Father of the Bride Part II,Comedy,1995,0.0,0.0,0.0,0.0,1.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

genres_list=df2.genres
genres_list
#for g in genres_list:
#    print(g.split('|'))

In [104]:
final_df.columns

Index(['movieId', 'title', 'genres', 'year', 'Action', 'Adventure',
       'Animation', 'Children', 'Comedy', 'Crime', 'Documentary', 'Drama',
       'Fantasy', 'Film-Noir', 'Horror', 'IMAX', 'Musical', 'Mystery',
       'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western'],
      dtype='object')

In [113]:
movie_df=final_df[['movieId','year', 'Action', 'Adventure',
       'Animation', 'Children', 'Comedy', 'Crime', 'Documentary', 'Drama',
       'Fantasy', 'Film-Noir', 'Horror', 'IMAX', 'Musical', 'Mystery',
       'Romance', 'Sci-Fi', 'Thriller', 'War', 'Western']]
movie_df.head(3)

,movieId,year,Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,...,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,1995,0.0,1.0,1.0,1.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,2,1995,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,3,1995,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0

In [114]:
movie_df['movieId'].values

array([     1,      2,      3, ..., 193585, 193587, 193609], dtype=int64)

In [115]:
movie_df.index=movie_df['movieId'].values  # cosine similarity create n*n dataframe based on index of dataframe that we pass in cosine_similarity

In [116]:
movie_df.drop(columns=['movieId'],inplace=True)

In [120]:
movie_df      # it includes all the features

,year,Action,Adventure,Animation,Children,Comedy,Crime,Documentary,Drama,Fantasy,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
1,1995,0.0,1.0,1.0,1.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,1995,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,1995,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
4,1995,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
5,1995,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
193581,2017,1.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
193583,2017,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
193585,2017,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
193587,2018,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
193609,1991,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [121]:
# getting the similarities betweeen movies, here data is at row level,  as high the the values as similar the movie
movie_similarity=cosine_similarity(movie_df,movie_df)
movie_similarity=pd.DataFrame(movie_similarity)
movie_similarity

,0,1,2,3,4,5,6,7,8,9,...,9694,9695,9696,9697,9698,9699,9700,9701,9702,9703
0,1.000000,1.000000,0.999999,0.999999,0.999999,0.999999,0.999999,1.000000,0.999999,0.999999,...,0.999999,0.999999,0.999999,0.999999,0.999999,1.000000,1.0,0.999999,0.999999,0.999999
1,1.000000,1.000000,0.999999,0.999999,0.999999,0.999999,0.999999,1.000000,0.999999,0.999999,...,0.999999,0.999999,0.999999,0.999999,0.999999,0.999999,1.0,1.000000,0.999999,0.999999
2,0.999999,0.999999,1.000000,1.000000,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000
3,0.999999,0.999999,1.000000,1.000000,1.000000,0.999999,1.000000,0.999999,0.999999,0.999999,...,0.999999,1.000000,1.000000,0.999999,0.999999,0.999999,1.0,1.000000,0.999999,1.000000
4,0.999999,0.999999,1.000000,1.000000,1.000000,0.999999,1.000000,1.000000,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9699,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,0.999999,1.000000,1.0,0.999999,1.000000,1.000000
9700,1.000000,1.000000,1.000000,1.000000,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000
9701,0.999999,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,0.999999,1.000000,1.000000,1.000000,1.000000,0.999999,1.0,1.000000,1.000000,1.000000
9702,0.999999,0.999999,1.000000,0.999999,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000
9703,0.999999,0.999999,1.000000,1.000000,1.000000,0.999999,1.000000,1.000000,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000

In [122]:
movieId_mapping=dict(zip(movie_similarity.index.values,movie_df.index.values))
movieId_mapping

{0: 1,
 1: 2,
 2: 3,
 3: 4,
 4: 5,
 5: 6,
 6: 7,
 7: 8,
 8: 9,
 9: 10,
 10: 11,
 11: 12,
 12: 13,
 13: 14,
 14: 15,
 15: 16,
 16: 17,
 17: 18,
 18: 19,
 19: 20,
 20: 21,
 21: 22,
 22: 23,
 23: 24,
 24: 25,
 25: 26,
 26: 27,
 27: 28,
 28: 29,
 29: 30,
 30: 31,
 31: 32,
 32: 34,
 33: 36,
 34: 38,
 35: 39,
 36: 40,
 37: 41,
 38: 42,
 39: 43,
 40: 44,
 41: 45,
 42: 46,
 43: 47,
 44: 48,
 45: 49,
 46: 50,
 47: 52,
 48: 53,
 49: 54,
 50: 55,
 51: 57,
 52: 58,
 53: 60,
 54: 61,
 55: 62,
 56: 63,
 57: 64,
 58: 65,
 59: 66,
 60: 68,
 61: 69,
 62: 70,
 63: 71,
 64: 72,
 65: 73,
 66: 74,
 67: 75,
 68: 76,
 69: 77,
 70: 78,
 71: 79,
 72: 80,
 73: 81,
 74: 82,
 75: 83,
 76: 85,
 77: 86,
 78: 87,
 79: 88,
 80: 89,
 81: 92,
 82: 93,
 83: 94,
 84: 95,
 85: 96,
 86: 97,
 87: 99,
 88: 100,
 89: 101,
 90: 102,
 91: 103,
 92: 104,
 93: 105,
 94: 106,
 95: 107,
 96: 108,
 97: 110,
 98: 111,
 99: 112,
 100: 113,
 101: 116,
 102: 117,
 103: 118,
 104: 119,
 105: 121,
 106: 122,
 107: 123,
 108: 125,
 109: 126,
 110: 128,
 111: 129,
 112: 132,
 113: 135,
 114: 137,
 115: 140,
 116: 141,
 117: 144,
 118: 145,
 119: 146,
 120: 147,
 121: 148,
 122: 149,
 123: 150,
 124: 151,
 125: 152,
 126: 153,
 127: 154,
 128: 155,
 129: 156,
 130: 157,
 131: 158,
 132: 159,
 133: 160,
 134: 161,
 135: 162,
 136: 163,
 137: 164,
 138: 165,
 139: 166,
 140: 168,
 141: 169,
 142: 170,
 143: 171,
 144: 172,
 145: 173,
 146: 174,
 147: 175,
 148: 176,
 149: 177,
 150: 178,
 151: 179,
 152: 180,
 153: 181,
 154: 183,
 155: 184,
 156: 185,
 157: 186,
 158: 187,
 159: 188,
 160: 189,
 161: 190,
 162: 191,
 163: 193,
 164: 194,
 165: 195,
 166: 196,
 167: 198,
 168: 199,
 169: 201,
 170: 202,
 171: 203,
 172: 204,
 173: 205,
 174: 206,
 175: 207,
 176: 208,
 177: 209,
 178: 210,
 179: 211,
 180: 212,
 181: 213,
 182: 214,
 183: 215,
 184: 216,
 185: 217,
 186: 218,
 187: 219,
 188: 220,
 189: 222,
 190: 223,
 191: 224,
 192: 225,
 193: 227,
 194: 228,
 195: 229,
 196: 230,
 197: 231,
 198: 232,
 199: 233,
 200: 234,
 201: 235,
 202: 236,
 203: 237,
 204: 238,
 205: 239,
 206: 240,
 207: 241,
 208: 242,
 209: 243,
 210: 246,
 211: 247,
 212: 248,
 213: 249,
 214: 250,
 215: 251,
 216: 252,
 217: 253,
 218: 254,
 219: 255,
 220: 256,
 221: 257,
 222: 258,
 223: 259,
 224: 260,
 225: 261,
 226: 262,
 227: 263,
 228: 265,
 229: 266,
 230: 267,
 231: 269,
 232: 270,
 233: 271,
 234: 272,
 235: 273,
 236: 274,
 237: 275,
 238: 276,
 239: 277,
 240: 278,
 241: 279,
 242: 280,
 243: 281,
 244: 282,
 245: 283,
 246: 284,
 247: 285,
 248: 287,
 249: 288,
 250: 289,
 251: 290,
 252: 291,
 253: 292,
 254: 293,
 255: 294,
 256: 295,
 257: 296,
 258: 298,
 259: 299,
 260: 300,
 261: 301,
 262: 302,
 263: 303,
 264: 304,
 265: 305,
 266: 306,
 267: 307,
 268: 308,
 269: 310,
 270: 311,
 271: 312,
 272: 313,
 273: 314,
 274: 315,
 275: 316,
 276: 317,
 277: 318,
 278: 319,
 279: 320,
 280: 321,
 281: 322,
 282: 324,
 283: 325,
 284: 326,
 285: 327,
 286: 328,
 287: 329,
 288: 330,
 289: 331,
 290: 332,
 291: 333,
 292: 334,
 293: 335,
 294: 336,
 295: 337,
 296: 338,
 297: 339,
 298: 340,
 299: 341,
 300: 342,
 301: 343,
 302: 344,
 303: 345,
 304: 346,
 305: 347,
 306: 348,
 307: 349,
 308: 350,
 309: 351,
 310: 352,
 311: 353,
 312: 354,
 313: 355,
 314: 356,
 315: 357,
 316: 358,
 317: 359,
 318: 360,
 319: 361,
 320: 362,
 321: 363,
 322: 364,
 323: 365,
 324: 366,
 325: 367,
 326: 368,
 327: 369,
 328: 370,
 329: 371,
 330: 372,
 331: 373,
 332: 374,
 333: 376,
 334: 377,
 335: 378,
 336: 379,
 337: 380,
 338: 381,
 339: 382,
 340: 383,
 341: 384,
 342: 385,
 343: 386,
 344: 387,
 345: 388,
 346: 389,
 347: 390,
 348: 391,
 349: 393,
 350: 405,
 351: 406,
 352: 407,
 353: 408,
 354: 409,
 355: 410,
 356: 412,
 357: 413,
 358: 414,
 359: 415,
 360: 416,
 361: 417,
 362: 418,
 363: 419,
 364: 420,
 365: 421,
 366: 422,
 367: 423,
 368: 424,
 369: 425,
 370: 426,
 371: 427,
 372: 428,
 373: 429,
 374: 430,
 375: 431,
 376: 432,
 377: 433,
 378: 434,
 379: 435,
 380: 436,
 381: 437,
 382: 438,
 383: 440,
 384: 441,
 385: 442,
 386: 444,
 387: 445,
 388: 446,
 389: 448,
 390: 449,
 391: 450,
 392: 451,
 393: 452,
 394: 453,
 395: 454,
 396: 455,
 397: 456,
 398: 457,
 399: 458,
 400: 459,
 401: 460,
 402: 461,
 403: 464,
 404: 466,
 405: 467,
 406: 468,
 407: 469,
 408: 470,
 409: 471,
 410: 472,
 411: 473,
 412: 474,
 413: 475,
 414: 476,
 415: 477,
 416: 478,
 417: 479,
 418: 480,
 419: 481,
 420: 482,
 421: 484,
 422: 485,
 423: 486,
 424: 487,
 425: 488,
 426: 489,
 427: 490,
 428: 491,
 429: 492,
 430: 493,
 431: 494,
 432: 495,
 433: 496,
 434: 497,
 435: 499,
 436: 500,
 437: 501,
 438: 502,
 439: 504,
 440: 505,
 441: 506,
 442: 507,
 443: 508,
 444: 509,
 445: 510,
 446: 511,
 447: 512,
 448: 513,
 449: 514,
 450: 515,
 451: 516,
 452: 517,
 453: 518,
 454: 519,
 455: 520,
 456: 521,
 457: 522,
 458: 523,
 459: 524,
 460: 526,
 461: 527,
 462: 528,
 463: 529,
 464: 531,
 465: 532,
 466: 533,
 467: 534,
 468: 535,
 469: 536,
 470: 537,
 471: 538,
 472: 539,
 473: 540,
 474: 541,
 475: 542,
 476: 543,
 477: 544,
 478: 546,
 479: 547,
 480: 548,
 481: 549,
 482: 550,
 483: 551,
 484: 552,
 485: 553,
 486: 555,
 487: 556,
 488: 558,
 489: 562,
 490: 563,
 491: 564,
 492: 567,
 493: 568,
 494: 569,
 495: 573,
 496: 574,
 497: 575,
 498: 577,
 499: 579,
 500: 580,
 501: 581,
 502: 583,
 503: 585,
 504: 586,
 505: 587,
 506: 588,
 507: 589,
 508: 590,
 509: 592,
 510: 593,
 511: 594,
 512: 595,
 513: 596,
 514: 597,
 515: 599,
 516: 600,
 517: 602,
 518: 605,
 519: 606,
 520: 608,
 521: 609,
 522: 610,
 523: 611,
 524: 612,
 525: 613,
 526: 615,
 527: 616,
 528: 617,
 529: 618,
 530: 619,
 531: 626,
 532: 627,
 533: 628,
 534: 631,
 535: 632,
 536: 633,
 537: 634,
 538: 635,
 539: 636,
 540: 637,
 541: 638,
 542: 639,
 543: 640,
 544: 645,
 545: 647,
 546: 648,
 547: 649,
 548: 650,
 549: 653,
 550: 656,
 551: 661,
 552: 662,
 553: 663,
 554: 665,
 555: 667,
 556: 668,
 557: 670,
 558: 671,
 559: 673,
 560: 674,
 561: 678,
 562: 679,
 563: 680,
 564: 685,
 565: 688,
 566: 691,
 567: 692,
 568: 694,
 569: 695,
 570: 697,
 571: 698,
 572: 700,
 573: 703,
 574: 704,
 575: 706,
 576: 707,
 577: 708,
 578: 709,
 579: 710,
 580: 711,
 581: 714,
 582: 715,
 583: 718,
 584: 719,
 585: 720,
 586: 722,
 587: 724,
 588: 725,
 589: 726,
 590: 728,
 591: 731,
 592: 733,
 593: 735,
 594: 736,
 595: 737,
 596: 741,
 597: 742,
 598: 743,
 599: 745,
 600: 747,
 601: 748,
 602: 750,
 603: 757,
 604: 759,
 605: 760,
 606: 761,
 607: 762,
 608: 764,
 609: 765,
 610: 766,
 611: 773,
 612: 775,
 613: 778,
 614: 779,
 615: 780,
 616: 781,
 617: 782,
 618: 783,
 619: 784,
 620: 785,
 621: 786,
 622: 788,
 623: 790,
 624: 791,
 625: 795,
 626: 798,
 627: 799,
 628: 800,
 629: 801,
 630: 802,
 631: 803,
 632: 804,
 633: 805,
 634: 806,
 635: 808,
 636: 809,
 637: 810,
 638: 813,
 639: 818,
 640: 823,
 641: 824,
 642: 828,
 643: 829,
 644: 830,
 645: 832,
 646: 833,
 647: 835,
 648: 836,
 649: 837,
 650: 838,
 651: 839,
 652: 840,
 653: 841,
 654: 842,
 655: 848,
 656: 849,
 657: 851,
 658: 852,
 659: 858,
 660: 861,
 661: 866,
 662: 867,
 663: 869,
 664: 870,
 665: 875,
 666: 876,
 667: 879,
 668: 880,
 669: 881,
 670: 882,
 671: 885,
 672: 886,
 673: 888,
 674: 889,
 675: 891,
 676: 892,
 677: 893,
 678: 896,
 679: 897,
 680: 898,
 681: 899,
 682: 900,
 683: 901,
 684: 902,
 685: 903,
 686: 904,
 687: 905,
 688: 906,
 689: 907,
 690: 908,
 691: 909,
 692: 910,
 693: 911,
 694: 912,
 695: 913,
 696: 914,
 697: 915,
 698: 916,
 699: 917,
 700: 918,
 701: 919,
 702: 920,
 703: 921,
 704: 922,
 705: 923,
 706: 924,
 707: 926,
 708: 927,
 709: 928,
 710: 929,
 711: 930,
 712: 931,
 713: 932,
 714: 933,
 715: 934,
 716: 935,
 717: 936,
 718: 937,
 719: 938,
 720: 940,
 721: 941,
 722: 942,
 723: 943,
 724: 944,
 725: 945,
 726: 946,
 727: 947,
 728: 948,
 729: 949,
 730: 950,
 731: 951,
 732: 952,
 733: 953,
 734: 954,
 735: 955,
 736: 956,
 737: 959,
 738: 961,
 739: 963,
 740: 965,
 741: 968,
 742: 969,
 743: 970,
 744: 971,
 745: 973,
 746: 976,
 747: 979,
 748: 981,
 749: 982,
 750: 984,
 751: 986,
 752: 987,
 753: 988,
 754: 990,
 755: 991,
 756: 993,
 757: 994,
 758: 996,
 759: 998,
 760: 999,
 761: 1003,
 762: 1004,
 763: 1005,
 764: 1006,
 765: 1007,
 766: 1008,
 767: 1009,
 768: 1010,
 769: 1011,
 770: 1012,
 771: 1013,
 772: 1014,
 773: 1015,
 774: 1016,
 775: 1017,
 776: 1018,
 777: 1019,
 778: 1020,
 779: 1021,
 780: 1022,
 781: 1023,
 782: 1024,
 783: 1025,
 784: 1027,
 785: 1028,
 786: 1029,
 787: 1030,
 788: 1031,
 789: 1032,
 790: 1033,
 791: 1034,
 792: 1035,
 793: 1036,
 794: 1037,
 795: 1040,
 796: 1041,
 797: 1042,
 798: 1043,
 799: 1046,
 800: 1047,
 801: 1049,
 802: 1050,
 803: 1051,
 804: 1053,
 805: 1054,
 806: 1055,
 807: 1056,
 808: 1057,
 809: 1059,
 810: 1060,
 811: 1061,
 812: 1064,
 813: 1066,
 814: 1068,
 815: 1073,
 816: 1076,
 817: 1077,
 818: 1078,
 819: 1079,
 820: 1080,
 821: 1081,
 822: 1082,
 823: 1083,
 824: 1084,
 825: 1085,
 826: 1086,
 827: 1088,
 828: 1089,
 829: 1090,
 830: 1091,
 831: 1092,
 832: 1093,
 833: 1094,
 834: 1095,
 835: 1096,
 836: 1097,
 837: 1099,
 838: 1100,
 839: 1101,
 840: 1103,
 841: 1104,
 842: 1105,
 843: 1107,
 844: 1111,
 845: 1112,
 846: 1114,
 847: 1116,
 848: 1117,
 849: 1119,
 850: 1120,
 851: 1121,
 852: 1123,
 853: 1124,
 854: 1125,
 855: 1126,
 856: 1127,
 857: 1128,
 858: 1129,
 859: 1130,
 860: 1131,
 861: 1132,
 862: 1135,
 863: 1136,
 864: 1137,
 865: 1140,
 866: 1144,
 867: 1147,
 868: 1148,
 869: 1150,
 870: 1151,
 871: 1156,
 872: 1161,
 873: 1162,
 874: 1163,
 875: 1167,
 876: 1170,
 877: 1171,
 878: 1172,
 879: 1173,
 880: 1175,
 881: 1176,
 882: 1177,
 883: 1178,
 884: 1179,
 885: 1180,
 886: 1183,
 887: 1184,
 888: 1185,
 889: 1186,
 890: 1187,
 891: 1188,
 892: 1189,
 893: 1190,
 894: 1191,
 895: 1192,
 896: 1193,
 897: 1194,
 898: 1196,
 899: 1197,
 900: 1198,
 901: 1199,
 902: 1200,
 903: 1201,
 904: 1202,
 905: 1203,
 906: 1204,
 907: 1206,
 908: 1207,
 909: 1208,
 910: 1209,
 911: 1210,
 912: 1211,
 913: 1212,
 914: 1213,
 915: 1214,
 916: 1215,
 917: 1216,
 918: 1217,
 919: 1218,
 920: 1219,
 921: 1220,
 922: 1221,
 923: 1222,
 924: 1223,
 925: 1224,
 926: 1225,
 927: 1226,
 928: 1227,
 929: 1228,
 930: 1230,
 931: 1231,
 932: 1232,
 933: 1233,
 934: 1234,
 935: 1235,
 936: 1236,
 937: 1237,
 938: 1238,
 939: 1240,
 940: 1241,
 941: 1242,
 942: 1243,
 943: 1244,
 944: 1245,
 945: 1246,
 946: 1247,
 947: 1248,
 948: 1249,
 949: 1250,
 950: 1251,
 951: 1252,
 952: 1253,
 953: 1254,
 954: 1255,
 955: 1256,
 956: 1257,
 957: 1258,
 958: 1259,
 959: 1260,
 960: 1261,
 961: 1262,
 962: 1263,
 963: 1264,
 964: 1265,
 965: 1266,
 966: 1267,
 967: 1268,
 968: 1269,
 969: 1270,
 970: 1271,
 971: 1272,
 972: 1273,
 973: 1274,
 974: 1275,
 975: 1276,
 976: 1277,
 977: 1278,
 978: 1279,
 979: 1280,
 980: 1281,
 981: 1282,
 982: 1283,
 983: 1284,
 984: 1285,
 985: 1286,
 986: 1287,
 987: 1288,
 988: 1289,
 989: 1290,
 990: 1291,
 991: 1292,
 992: 1293,
 993: 1295,
 994: 1296,
 995: 1297,
 996: 1298,
 997: 1299,
 998: 1300,
 999: 1301,
 ...}

In [126]:
# to make the index relavant that show the true relation as data is at row level where each row represent one single movie and it's similarity with others 
movie_similarity.index=movie_df.index.values
movie_similarity.columns=movie_df.index.values
movie_similarity

,1,2,3,4,5,6,7,8,9,10,...,193565,193567,193571,193573,193579,193581,193583,193585,193587,193609
1,1.000000,1.000000,0.999999,0.999999,0.999999,0.999999,0.999999,1.000000,0.999999,0.999999,...,0.999999,0.999999,0.999999,0.999999,0.999999,1.000000,1.0,0.999999,0.999999,0.999999
2,1.000000,1.000000,0.999999,0.999999,0.999999,0.999999,0.999999,1.000000,0.999999,0.999999,...,0.999999,0.999999,0.999999,0.999999,0.999999,0.999999,1.0,1.000000,0.999999,0.999999
3,0.999999,0.999999,1.000000,1.000000,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000
4,0.999999,0.999999,1.000000,1.000000,1.000000,0.999999,1.000000,0.999999,0.999999,0.999999,...,0.999999,1.000000,1.000000,0.999999,0.999999,0.999999,1.0,1.000000,0.999999,1.000000
5,0.999999,0.999999,1.000000,1.000000,1.000000,0.999999,1.000000,1.000000,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
193581,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,0.999999,1.000000,1.0,0.999999,1.000000,1.000000
193583,1.000000,1.000000,1.000000,1.000000,1.000000,0.999999,1.000000,0.999999,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000
193585,0.999999,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,0.999999,1.000000,1.000000,1.000000,1.000000,0.999999,1.0,1.000000,1.000000,1.000000
193587,0.999999,0.999999,1.000000,0.999999,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000
193609,0.999999,0.999999,1.000000,1.000000,1.000000,0.999999,1.000000,1.000000,1.000000,0.999999,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.0,1.000000,1.000000,1.000000

In [125]:
# for reference for understanding purpose

#movies_sim_score = movie_similarity[movie_similarity.index==2]
#np.argsort(movies_sim_score.values)

In [44]:
for i in [1, 2, 3]:  # Here we are passing movie IDs
    #print('Recommended movies for movieId', i)
    movies_id_score = movie_similarity[movie_similarity.index == i]
    top_3_similar_movies = list(np.argsort(movies_id_score.values)[0])[-4:-1][::-1]
    #print('Movie Index:',top_3_similar_movies)

    similar_movies = [movieId_mapping[j] for j in top_3_similar_movies]
    
    print(f'Similar movies for movie {i} are:\n', similar_movies)

Similar movies for movie 1 are:
 [2294, 3114, 4016]
Similar movies for movie 2 are:
 [60, 173873, 126]
Similar movies for movie 3 are:
 [339, 180, 186]

In [45]:
for i in final_df.movieId.values[0:100]:   
    print('MovieId', i)
    display(final_df[final_df.movieId == i][['movieId', 'title', 'genres']])

    movie_id_score = movie_similarity[movie_similarity.index == i]
    top_3_similar_movies = list(np.argsort(movie_id_score.values)[0])[-4:-1][::-1]   

    similar_movies = [movieId_mapping[j] for j in top_3_similar_movies]

    print(f'Similar movies for MovieId {i} are:')
    display(final_df[final_df.movieId.isin(similar_movies)][['movieId', 'title', 'genres','year']])
    print('------------------------------------------------------------------------------')

MovieId 1

   movieId      title                                       genres
0        1  Toy Story  Adventure|Animation|Children|Comedy|Fantasy

Similar movies for MovieId 1 are:

,movieId,title,genres,year
1706,2294,Antz,Adventure|Animation|Children|Comedy|Fantasy,1998
2355,3114,Toy Story 2,Adventure|Animation|Children|Comedy|Fantasy,1999
3000,4016,"Emperor's New Groove, The",Adventure|Animation|Children|Comedy|Fantasy,2000

------------------------------------------------------------------------------
MovieId 2

   movieId    title                      genres
1        2  Jumanji  Adventure|Children|Fantasy

Similar movies for MovieId 2 are:

      movieId                        title                      genres  year
53         60  Indian in the Cupboard, The  Adventure|Children|Fantasy  1995
109       126   NeverEnding Story III, The  Adventure|Children|Fantasy  1994
9532   173873           Gulliver's Travels  Adventure|Children|Fantasy  1996

------------------------------------------------------------------------------
MovieId 3

   movieId             title          genres
2        3  Grumpier Old Men  Comedy|Romance

Similar movies for MovieId 3 are:

     movieId                    title          genres  year
152      180                 Mallrats  Comedy|Romance  1995
157      186              Nine Months  Comedy|Romance  1995
297      339  While You Were Sleeping  Comedy|Romance  1995

------------------------------------------------------------------------------
MovieId 4

   movieId              title                genres
3        4  Waiting to Exhale  Comedy|Drama|Romance

Similar movies for MovieId 4 are:

     movieId                    title                genres  year
10        11  American President, The  Comedy|Drama|Romance  1995
165      195  Something to Talk About  Comedy|Drama|Romance  1995
191      224         Don Juan DeMarco  Comedy|Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 5

   movieId                        title  genres
4        5  Father of the Bride Part II  Comedy

Similar movies for MovieId 5 are:

     movieId            title  genres  year
240      278   Miami Rhapsody  Comedy  1995
536      633  Denise Calls Up  Comedy  1995
537      634     Theodore Rex  Comedy  1995

------------------------------------------------------------------------------
MovieId 6

   movieId title                 genres
5        6  Heat  Action|Crime|Thriller

Similar movies for MovieId 6 are:

     movieId      title                 genres  year
5          6       Heat  Action|Crime|Thriller  1995
22        23  Assassins  Action|Crime|Thriller  1995
156      185   Net, The  Action|Crime|Thriller  1995

------------------------------------------------------------------------------
MovieId 7

   movieId    title          genres
6        7  Sabrina  Comedy|Romance

Similar movies for MovieId 7 are:

     movieId                    title          genres  year
152      180                 Mallrats  Comedy|Romance  1995
157      186              Nine Months  Comedy|Romance  1995
297      339  While You Were Sleeping  Comedy|Romance  1995

------------------------------------------------------------------------------
MovieId 8

   movieId         title              genres
7        8  Tom and Huck  Adventure|Children

Similar movies for MovieId 8 are:

,movieId,title,genres,year
7,8,Tom and Huck,Adventure|Children,1995
131,158,Casper,Adventure|Children,1995
204,238,Far From Home: The Adventures of Yellow Dog,Adventure|Children,1995

------------------------------------------------------------------------------
MovieId 9

   movieId         title  genres
8        9  Sudden Death  Action

Similar movies for MovieId 9 are:

     movieId                                title  genres  year
63        71                            Fair Game  Action  1995
172      204        Under Siege 2: Dark Territory  Action  1995
876     1170  Best of the Best 3: No Turning Back  Action  1995

------------------------------------------------------------------------------
MovieId 10

   movieId      title                     genres
9       10  GoldenEye  Action|Adventure|Thriller

Similar movies for MovieId 10 are:

     movieId         title                     genres  year
84        95  Broken Arrow  Action|Adventure|Thriller  1996
592      733     Rock, The  Action|Adventure|Thriller  1996
754      990  Maximum Risk  Action|Adventure|Thriller  1996

------------------------------------------------------------------------------
MovieId 11

    movieId                    title                genres
10       11  American President, The  Comedy|Drama|Romance

Similar movies for MovieId 11 are:

     movieId                    title                genres  year
10        11  American President, The  Comedy|Drama|Romance  1995
165      195  Something to Talk About  Comedy|Drama|Romance  1995
191      224         Don Juan DeMarco  Comedy|Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 12

    movieId                        title         genres
11       12  Dracula: Dead and Loving It  Comedy|Horror

Similar movies for MovieId 12 are:

,movieId,title,genres,year
654,842,Tales from the Crypt Presents: Bordello of Blood,Comedy|Horror,1996
4780,7117,Leprechaun,Comedy|Horror,1993
8065,99130,Ice Cream Man,Comedy|Horror,1995

------------------------------------------------------------------------------
MovieId 13

    movieId  title                        genres
12       13  Balto  Adventure|Animation|Children

Similar movies for MovieId 13 are:

,movieId,title,genres,year
2694,3615,Dinosaur,Adventure|Animation|Children,2000
2941,3945,Digimon: The Movie,Adventure|Animation|Children,2000
7909,95193,Pocahontas II: Journey to a New World,Adventure|Animation|Children,1998

------------------------------------------------------------------------------
MovieId 14

    movieId  title genres
13       14  Nixon  Drama

Similar movies for MovieId 14 are:

     movieId      title genres  year
25        26    Othello  Drama  1995
241      279  My Family  Drama  1995
539      636      Frisk  Drama  1995

------------------------------------------------------------------------------
MovieId 15

    movieId             title                    genres
14       15  Cutthroat Island  Action|Adventure|Romance

Similar movies for MovieId 15 are:

      movieId                          title                    genres  year
720       940  Adventures of Robin Hood, The  Action|Adventure|Romance  1938
5438    25962           King Solomon's Mines  Action|Adventure|Romance  1950
8131   101577                      Host, The  Action|Adventure|Romance  2013

------------------------------------------------------------------------------
MovieId 16

    movieId   title       genres
15       16  Casino  Crime|Drama

Similar movies for MovieId 16 are:

     movieId                                        title       genres  year
29        30  Shanghai Triad Yao a yao yao dao waipo qiao  Crime|Drama  1995
86        97                               Hate Haine, La  Crime|Drama  1995
102      117               Young Poisoner's Handbook, The  Crime|Drama  1995

------------------------------------------------------------------------------
MovieId 17

    movieId                  title         genres
16       17  Sense and Sensibility  Drama|Romance

Similar movies for MovieId 17 are:

     movieId                  title         genres  year
16        17  Sense and Sensibility  Drama|Romance  1995
45        49  When Night Is Falling  Drama|Romance  1995
170      202          Total Eclipse  Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 18

    movieId       title  genres
17       18  Four Rooms  Comedy

Similar movies for MovieId 18 are:

     movieId            title  genres  year
240      278   Miami Rhapsody  Comedy  1995
536      633  Denise Calls Up  Comedy  1995
537      634     Theodore Rex  Comedy  1995

------------------------------------------------------------------------------
MovieId 19

    movieId                           title  genres
18       19  Ace Ventura: When Nature Calls  Comedy

Similar movies for MovieId 19 are:

     movieId            title  genres  year
240      278   Miami Rhapsody  Comedy  1995
536      633  Denise Calls Up  Comedy  1995
537      634     Theodore Rex  Comedy  1995

------------------------------------------------------------------------------
MovieId 20

    movieId        title                              genres
19       20  Money Train  Action|Comedy|Crime|Drama|Thriller

Similar movies for MovieId 20 are:

      movieId                title                              genres  year
118       145             Bad Boys  Action|Comedy|Crime|Drama|Thriller  1995
1103     1432                Metro  Action|Comedy|Crime|Drama|Thriller  1997
4693     7007  Last Boy Scout, The  Action|Comedy|Crime|Drama|Thriller  1991

------------------------------------------------------------------------------
MovieId 21

    movieId       title                 genres
20       21  Get Shorty  Comedy|Crime|Thriller

Similar movies for MovieId 21 are:

      movieId                              title                 genres  year
1274     1689       Man Who Knew Too Little, The  Comedy|Crime|Thriller  1997
1917     2542  Lock, Stock & Two Smoking Barrels  Comedy|Crime|Thriller  1998
1951     2586                      Goodbye Lover  Comedy|Crime|Thriller  1999

------------------------------------------------------------------------------
MovieId 22

    movieId    title                               genres
21       22  Copycat  Crime|Drama|Horror|Mystery|Thriller

Similar movies for MovieId 22 are:

,movieId,title,genres,year
324,366,Wes Craven's New Nightmare Nightmare on Elm St...,Drama|Horror|Mystery|Thriller,1994
533,628,Primal Fear,Crime|Drama|Mystery|Thriller,1996
1082,1406,La Cérémonie,Crime|Drama|Mystery|Thriller,1995

------------------------------------------------------------------------------
MovieId 23

    movieId      title                 genres
22       23  Assassins  Action|Crime|Thriller

Similar movies for MovieId 23 are:

     movieId      title                 genres  year
5          6       Heat  Action|Crime|Thriller  1995
22        23  Assassins  Action|Crime|Thriller  1995
156      185   Net, The  Action|Crime|Thriller  1995

------------------------------------------------------------------------------
MovieId 24

    movieId   title        genres
23       24  Powder  Drama|Sci-Fi

Similar movies for MovieId 24 are:

      movieId                          title        genres  year
23         24                         Powder  Drama|Sci-Fi  1995
1187     1584                        Contact  Drama|Sci-Fi  1997
5023     7811  Babylon 5: The River of Souls  Drama|Sci-Fi  1998

------------------------------------------------------------------------------
MovieId 25

    movieId              title         genres
24       25  Leaving Las Vegas  Drama|Romance

Similar movies for MovieId 25 are:

     movieId                  title         genres  year
16        17  Sense and Sensibility  Drama|Romance  1995
45        49  When Night Is Falling  Drama|Romance  1995
170      202          Total Eclipse  Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 26

    movieId    title genres
25       26  Othello  Drama

Similar movies for MovieId 26 are:

     movieId      title genres  year
25        26    Othello  Drama  1995
241      279  My Family  Drama  1995
539      636      Frisk  Drama  1995

------------------------------------------------------------------------------
MovieId 27

    movieId         title          genres
26       27  Now and Then  Children|Drama

Similar movies for MovieId 27 are:

     movieId               title          genres  year
32        34                Babe  Children|Drama  1995
207      241               Fluke  Children|Drama  1995
226      262  Little Princess, A  Children|Drama  1995

------------------------------------------------------------------------------
MovieId 28

    movieId       title         genres
27       28  Persuasion  Drama|Romance

Similar movies for MovieId 28 are:

     movieId                  title         genres  year
16        17  Sense and Sensibility  Drama|Romance  1995
45        49  When Night Is Falling  Drama|Romance  1995
170      202          Total Eclipse  Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 29

,movieId,title,genres
28,29,"City of Lost Children, The Cité des enfants pe...",Adventure|Drama|Fantasy|Mystery|Sci-Fi

Similar movies for MovieId 29 are:

,movieId,title,genres,year
3559,4874,K-PAX,Drama|Fantasy|Mystery|Sci-Fi,2001
4784,7123,Naked Lunch,Drama|Fantasy|Mystery|Sci-Fi,1991
9132,147372,Doctor Who: Last Christmas,Adventure|Drama|Fantasy|Sci-Fi,2014

------------------------------------------------------------------------------
MovieId 30

    movieId                                        title       genres
29       30  Shanghai Triad Yao a yao yao dao waipo qiao  Crime|Drama

Similar movies for MovieId 30 are:

     movieId                                        title       genres  year
29        30  Shanghai Triad Yao a yao yao dao waipo qiao  Crime|Drama  1995
86        97                               Hate Haine, La  Crime|Drama  1995
102      117               Young Poisoner's Handbook, The  Crime|Drama  1995

------------------------------------------------------------------------------
MovieId 31

    movieId            title genres
30       31  Dangerous Minds  Drama

Similar movies for MovieId 31 are:

     movieId      title genres  year
25        26    Othello  Drama  1995
241      279  My Family  Drama  1995
539      636      Frisk  Drama  1995

------------------------------------------------------------------------------
MovieId 32

    movieId                             title                   genres
31       32  Twelve Monkeys a.k.a. 12 Monkeys  Mystery|Sci-Fi|Thriller

Similar movies for MovieId 32 are:

      movieId          title                   genres  year
91        103  Unforgettable  Mystery|Sci-Fi|Thriller  1996
7089    70286     District 9  Mystery|Sci-Fi|Thriller  2009
9074   143255     Narcopolis  Mystery|Sci-Fi|Thriller  2014

------------------------------------------------------------------------------
MovieId 34

    movieId title          genres
32       34  Babe  Children|Drama

Similar movies for MovieId 34 are:

     movieId               title          genres  year
32        34                Babe  Children|Drama  1995
207      241               Fluke  Children|Drama  1995
226      262  Little Princess, A  Children|Drama  1995

------------------------------------------------------------------------------
MovieId 36

    movieId             title       genres
33       36  Dead Man Walking  Crime|Drama

Similar movies for MovieId 36 are:

     movieId                                        title       genres  year
29        30  Shanghai Triad Yao a yao yao dao waipo qiao  Crime|Drama  1995
86        97                               Hate Haine, La  Crime|Drama  1995
102      117               Young Poisoner's Handbook, The  Crime|Drama  1995

------------------------------------------------------------------------------
MovieId 38

    movieId         title           genres
34       38  It Takes Two  Children|Comedy

Similar movies for MovieId 38 are:

     movieId                       title           genres  year
34        38                It Takes Two  Children|Comedy  1995
214      250  Heavyweights Heavy Weights  Children|Comedy  1995
763     1005        D3: The Mighty Ducks  Children|Comedy  1996

------------------------------------------------------------------------------
MovieId 39

    movieId     title          genres
35       39  Clueless  Comedy|Romance

Similar movies for MovieId 39 are:

     movieId                    title          genres  year
152      180                 Mallrats  Comedy|Romance  1995
157      186              Nine Months  Comedy|Romance  1995
297      339  While You Were Sleeping  Comedy|Romance  1995

------------------------------------------------------------------------------
MovieId 40

    movieId                     title genres
36       40  Cry, the Beloved Country  Drama

Similar movies for MovieId 40 are:

     movieId      title genres  year
25        26    Othello  Drama  1995
241      279  My Family  Drama  1995
539      636      Frisk  Drama  1995

------------------------------------------------------------------------------
MovieId 41

    movieId        title     genres
37       41  Richard III  Drama|War

Similar movies for MovieId 41 are:

      movieId                 title     genres  year
65         73       Misérables, Les  Drama|War  1995
294       336     Walking Dead, The  Drama|War  1995
6127    43677  Tuskegee Airmen, The  Drama|War  1995

------------------------------------------------------------------------------
MovieId 42

    movieId            title              genres
38       42  Dead Presidents  Action|Crime|Drama

Similar movies for MovieId 42 are:

     movieId            title              genres  year
341      384      Bad Company  Action|Crime|Drama  1995
568      694  Substitute, The  Action|Crime|Drama  1996
665      875  Nothing to Lose  Action|Crime|Drama  1994

------------------------------------------------------------------------------
MovieId 43

    movieId        title genres
39       43  Restoration  Drama

Similar movies for MovieId 43 are:

     movieId      title genres  year
25        26    Othello  Drama  1995
241      279  My Family  Drama  1995
539      636      Frisk  Drama  1995

------------------------------------------------------------------------------
MovieId 44

    movieId          title                    genres
40       44  Mortal Kombat  Action|Adventure|Fantasy

Similar movies for MovieId 44 are:

      movieId                        title                    genres  year
349       393               Street Fighter  Action|Adventure|Fantasy  1994
549       653                  Dragonheart  Action|Adventure|Fantasy  1996
1266     1681  Mortal Kombat: Annihilation  Action|Adventure|Fantasy  1997

------------------------------------------------------------------------------
MovieId 45

    movieId       title                 genres
41       45  To Die For  Comedy|Drama|Thriller

Similar movies for MovieId 45 are:

      movieId             title                 genres  year
278       319     Shallow Grave  Comedy|Drama|Thriller  1994
3852     5416           Cherish  Comedy|Drama|Thriller  2002
4247     6193  Poolhall Junkies  Comedy|Drama|Thriller  2002

------------------------------------------------------------------------------
MovieId 46

    movieId                          title         genres
42       46  How to Make an American Quilt  Drama|Romance

Similar movies for MovieId 46 are:

     movieId                  title         genres  year
16        17  Sense and Sensibility  Drama|Romance  1995
45        49  When Night Is Falling  Drama|Romance  1995
170      202          Total Eclipse  Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 47

    movieId               title            genres
43       47  Seven a.k.a. Se7en  Mystery|Thriller

Similar movies for MovieId 47 are:

     movieId       title            genres  year
221      257  Just Cause  Mystery|Thriller  1995
293      335  Underneath  Mystery|Thriller  1995
569      695  True Crime  Mystery|Thriller  1996

------------------------------------------------------------------------------
MovieId 48

    movieId       title                                    genres
44       48  Pocahontas  Animation|Children|Drama|Musical|Romance

Similar movies for MovieId 48 are:

,movieId,title,genres,year
618,783,"Hunchback of Notre Dame, The",Animation|Children|Drama|Musical|Romance,1996
786,1029,Dumbo,Animation|Children|Drama|Musical,1941
8976,138702,Feast,Animation|Children|Comedy|Drama|Romance,2014

------------------------------------------------------------------------------
MovieId 49

    movieId                  title         genres
45       49  When Night Is Falling  Drama|Romance

Similar movies for MovieId 49 are:

     movieId                  title         genres  year
16        17  Sense and Sensibility  Drama|Romance  1995
45        49  When Night Is Falling  Drama|Romance  1995
170      202          Total Eclipse  Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 50

    movieId                title                  genres
46       50  Usual Suspects, The  Crime|Mystery|Thriller

Similar movies for MovieId 50 are:

      movieId           title                  genres  year
828      1089  Reservoir Dogs  Crime|Mystery|Thriller  1992
1250     1661      Switchback  Crime|Mystery|Thriller  1997
1945     2579       Following  Crime|Mystery|Thriller  1998

------------------------------------------------------------------------------
MovieId 52

    movieId             title                genres
47       52  Mighty Aphrodite  Comedy|Drama|Romance

Similar movies for MovieId 52 are:

     movieId                    title                genres  year
10        11  American President, The  Comedy|Drama|Romance  1995
165      195  Something to Talk About  Comedy|Drama|Romance  1995
191      224         Don Juan DeMarco  Comedy|Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 53

    movieId     title           genres
48       53  Lamerica  Adventure|Drama

Similar movies for MovieId 53 are:

      movieId                       title           genres  year
1216     1615                   Edge, The  Adventure|Drama  1997
3440     4688                  Black Robe  Adventure|Drama  1991
5340     8905  1492: Conquest of Paradise  Adventure|Drama  1992

------------------------------------------------------------------------------
MovieId 54

    movieId           title           genres
49       54  Big Green, The  Children|Comedy

Similar movies for MovieId 54 are:

     movieId                       title           genres  year
34        38                It Takes Two  Children|Comedy  1995
214      250  Heavyweights Heavy Weights  Children|Comedy  1995
763     1005        D3: The Mighty Ducks  Children|Comedy  1996

------------------------------------------------------------------------------
MovieId 55

    movieId    title genres
50       55  Georgia  Drama

Similar movies for MovieId 55 are:

     movieId      title genres  year
25        26    Othello  Drama  1995
241      279  My Family  Drama  1995
539      636      Frisk  Drama  1995

------------------------------------------------------------------------------
MovieId 57

    movieId                  title genres
51       57  Home for the Holidays  Drama

Similar movies for MovieId 57 are:

     movieId      title genres  year
25        26    Othello  Drama  1995
241      279  My Family  Drama  1995
539      636      Frisk  Drama  1995

------------------------------------------------------------------------------
MovieId 58

    movieId                     title                genres
52       58  Postman, The Postino, Il  Comedy|Drama|Romance

Similar movies for MovieId 58 are:

     movieId                               title                genres  year
52        58            Postman, The Postino, Il  Comedy|Drama|Romance  1994
198      232  Eat Drink Man Woman Yin shi nan nu  Comedy|Drama|Romance  1994
319      361              It Could Happen to You  Comedy|Drama|Romance  1994

------------------------------------------------------------------------------
MovieId 60

    movieId                        title                      genres
53       60  Indian in the Cupboard, The  Adventure|Children|Fantasy

Similar movies for MovieId 60 are:

      movieId                        title                      genres  year
53         60  Indian in the Cupboard, The  Adventure|Children|Fantasy  1995
109       126   NeverEnding Story III, The  Adventure|Children|Fantasy  1994
9532   173873           Gulliver's Travels  Adventure|Children|Fantasy  1996

------------------------------------------------------------------------------
MovieId 61

    movieId           title          genres
54       61  Eye for an Eye  Drama|Thriller

Similar movies for MovieId 61 are:

      movieId          title          genres  year
88        100      City Hall  Drama|Thriller  1996
252       291  Poison Ivy II  Drama|Thriller  1996
1133     1483          Crash  Drama|Thriller  1996

------------------------------------------------------------------------------
MovieId 62

    movieId               title genres
55       62  Mr. Holland's Opus  Drama

Similar movies for MovieId 62 are:

     movieId      title genres  year
25        26    Othello  Drama  1995
241      279  My Family  Drama  1995
539      636      Frisk  Drama  1995

------------------------------------------------------------------------------
MovieId 63

    movieId                                              title        genres
56       63  Don't Be a Menace to South Central While Drink...  Comedy|Crime

Similar movies for MovieId 63 are:

,movieId,title,genres,year
56,63,Don't Be a Menace to South Central While Drink...,Comedy|Crime,1996
662,867,Carpool,Comedy|Crime,1996
1298,1732,"Big Lebowski, The",Comedy|Crime,1998

------------------------------------------------------------------------------
MovieId 64

    movieId          title          genres
57       64  Two if by Sea  Comedy|Romance

Similar movies for MovieId 64 are:

,movieId,title,genres,year
103,118,If Lucy Fell,Comedy|Romance,1996
566,691,Mrs. Winterbourne,Comedy|Romance,1996
1179,1571,When the Cat's Away Chacun cherche son chat,Comedy|Romance,1996

------------------------------------------------------------------------------
MovieId 65

    movieId     title  genres
58       65  Bio-Dome  Comedy

Similar movies for MovieId 65 are:

      movieId                       title  genres  year
1089     1414                      Mother  Comedy  1996
1153     1516  Children of the Revolution  Comedy  1996
1188     1585               Love Serenade  Comedy  1996

------------------------------------------------------------------------------
MovieId 66

    movieId                               title                  genres
59       66  Lawnmower Man 2: Beyond Cyberspace  Action|Sci-Fi|Thriller

Similar movies for MovieId 66 are:

     movieId                               title                  genres  year
59        66  Lawnmower Man 2: Beyond Cyberspace  Action|Sci-Fi|Thriller  1996
296      338                          Virtuosity  Action|Sci-Fi|Thriller  1995
601      748                        Arrival, The  Action|Sci-Fi|Thriller  1996

------------------------------------------------------------------------------
MovieId 68

    movieId                      title          genres
60       68  French Twist Gazon maudit  Comedy|Romance

Similar movies for MovieId 68 are:

     movieId                    title          genres  year
152      180                 Mallrats  Comedy|Romance  1995
157      186              Nine Months  Comedy|Romance  1995
297      339  While You Were Sleeping  Comedy|Romance  1995

------------------------------------------------------------------------------
MovieId 69

    movieId   title  genres
61       69  Friday  Comedy

Similar movies for MovieId 69 are:

     movieId            title  genres  year
240      278   Miami Rhapsody  Comedy  1995
536      633  Denise Calls Up  Comedy  1995
537      634     Theodore Rex  Comedy  1995

------------------------------------------------------------------------------
MovieId 70

    movieId                title                         genres
62       70  From Dusk Till Dawn  Action|Comedy|Horror|Thriller

Similar movies for MovieId 70 are:

,movieId,title,genres,year
6250,46965,Snakes on a Plane,Action|Comedy|Horror|Thriller,2006
6323,48678,Feast,Action|Comedy|Horror|Thriller,2005
7148,71494,"Haunted World of El Superbeasto, The",Action|Animation|Comedy|Horror|Thriller,2009

------------------------------------------------------------------------------
MovieId 71

    movieId      title  genres
63       71  Fair Game  Action

Similar movies for MovieId 71 are:

     movieId                                title  genres  year
63        71                            Fair Game  Action  1995
172      204        Under Siege 2: Dark Territory  Action  1995
876     1170  Best of the Best 3: No Turning Back  Action  1995

------------------------------------------------------------------------------
MovieId 72

    movieId                  title        genres
64       72  Kicking and Screaming  Comedy|Drama

Similar movies for MovieId 72 are:

     movieId                   title        genres  year
74        82  Antonia's Line Antonia  Comedy|Drama  1995
129      156        Blue in the Face  Comedy|Drama  1995
281      322    Swimming with Sharks  Comedy|Drama  1995

------------------------------------------------------------------------------
MovieId 73

    movieId            title     genres
65       73  Misérables, Les  Drama|War

Similar movies for MovieId 73 are:

      movieId                 title     genres  year
65         73       Misérables, Les  Drama|War  1995
294       336     Walking Dead, The  Drama|War  1995
6127    43677  Tuskegee Airmen, The  Drama|War  1995

------------------------------------------------------------------------------
MovieId 74

    movieId         title         genres
66       74  Bed of Roses  Drama|Romance

Similar movies for MovieId 74 are:

      movieId              title         genres  year
570       697  Feeling Minnesota  Drama|Romance  1996
1147     1502             Kissed  Drama|Romance  1996
1172     1554   Pillow Book, The  Drama|Romance  1996

------------------------------------------------------------------------------
MovieId 75

    movieId      title        genres
67       75  Big Bully  Comedy|Drama

Similar movies for MovieId 75 are:

     movieId               title        genres  year
757      994           Big Night  Comedy|Drama  1996
797     1042  That Thing You Do!  Comedy|Drama  1996
810     1060            Swingers  Comedy|Drama  1996

------------------------------------------------------------------------------
MovieId 76

    movieId      title                  genres
68       76  Screamers  Action|Sci-Fi|Thriller

Similar movies for MovieId 76 are:

     movieId            title                  genres  year
68        76        Screamers  Action|Sci-Fi|Thriller  1995
144      172  Johnny Mnemonic  Action|Sci-Fi|Thriller  1995
601      748     Arrival, The  Action|Sci-Fi|Thriller  1996

------------------------------------------------------------------------------
MovieId 77

    movieId      title       genres
69       77  Nico Icon  Documentary

Similar movies for MovieId 77 are:

     movieId                          title       genres  year
87        99  Heidi Fleiss: Hollywood Madam  Documentary  1995
101      116          Anne Frank Remembered  Documentary  1995
174      206                       Unzipped  Documentary  1995

------------------------------------------------------------------------------
MovieId 78

    movieId                title                       genres
70       78  Crossing Guard, The  Action|Crime|Drama|Thriller

Similar movies for MovieId 78 are:

,movieId,title,genres,year
254,293,Léon: The Professional a.k.a. The Professional...,Action|Crime|Drama|Thriller,1994
307,349,Clear and Present Danger,Action|Crime|Drama|Thriller,1994
758,996,Last Man Standing,Action|Crime|Drama|Thriller,1996

------------------------------------------------------------------------------
MovieId 79

    movieId       title          genres
71       79  Juror, The  Drama|Thriller

Similar movies for MovieId 79 are:

      movieId          title          genres  year
88        100      City Hall  Drama|Thriller  1996
252       291  Poison Ivy II  Drama|Thriller  1996
1133     1483          Crash  Drama|Thriller  1996

------------------------------------------------------------------------------
MovieId 80

    movieId                               title          genres
72       80  White Balloon, The Badkonake sefid  Children|Drama

Similar movies for MovieId 80 are:

     movieId               title          genres  year
32        34                Babe  Children|Drama  1995
207      241               Fluke  Children|Drama  1995
226      262  Little Princess, A  Children|Drama  1995

------------------------------------------------------------------------------
MovieId 81

    movieId                                    title               genres
73       81  Things to Do in Denver When You're Dead  Crime|Drama|Romance

Similar movies for MovieId 81 are:

      movieId                 title               genres  year
804      1053           Normal Life  Crime|Drama|Romance  1996
1086     1411                Hamlet  Crime|Drama|Romance  1996
1090     1415  Thieves Voleurs, Les  Crime|Drama|Romance  1996

------------------------------------------------------------------------------
MovieId 82

    movieId                   title        genres
74       82  Antonia's Line Antonia  Comedy|Drama

Similar movies for MovieId 82 are:

     movieId                   title        genres  year
74        82  Antonia's Line Antonia  Comedy|Drama  1995
129      156        Blue in the Face  Comedy|Drama  1995
281      322    Swimming with Sharks  Comedy|Drama  1995

------------------------------------------------------------------------------
MovieId 83

    movieId                                     title         genres
75       83  Once Upon a Time... When We Were Colored  Drama|Romance

Similar movies for MovieId 83 are:

     movieId                  title         genres  year
16        17  Sense and Sensibility  Drama|Romance  1995
45        49  When Night Is Falling  Drama|Romance  1995
170      202          Total Eclipse  Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 85

    movieId               title         genres
76       85  Angels and Insects  Drama|Romance

Similar movies for MovieId 85 are:

     movieId                  title         genres  year
16        17  Sense and Sensibility  Drama|Romance  1995
45        49  When Night Is Falling  Drama|Romance  1995
170      202          Total Eclipse  Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 86

    movieId         title                  genres
77       86  White Squall  Action|Adventure|Drama

Similar movies for MovieId 86 are:

      movieId                      title                  genres  year
1331     1801  Man in the Iron Mask, The  Action|Adventure|Drama  1998
2177     2893        Plunkett & MaCleane  Action|Adventure|Drama  1999
2674     3578                  Gladiator  Action|Adventure|Drama  2000

------------------------------------------------------------------------------
MovieId 87

    movieId              title           genres
78       87  Dunston Checks In  Children|Comedy

Similar movies for MovieId 87 are:

      movieId               title           genres  year
78         87   Dunston Checks In  Children|Comedy  1996
629       801     Harriet the Spy  Children|Comedy  1996
1047     1359  Jingle All the Way  Children|Comedy  1996

------------------------------------------------------------------------------
MovieId 88

    movieId        title  genres
79       88  Black Sheep  Comedy

Similar movies for MovieId 88 are:

      movieId                       title  genres  year
1089     1414                      Mother  Comedy  1996
1153     1516  Children of the Revolution  Comedy  1996
1188     1585               Love Serenade  Comedy  1996

------------------------------------------------------------------------------
MovieId 89

    movieId         title           genres
80       89  Nick of Time  Action|Thriller

Similar movies for MovieId 89 are:

      movieId                      title           genres  year
651       839  Crow: City of Angels, The  Action|Thriller  1996
762      1004           Glimmer Man, The  Action|Thriller  1996
8919   136012             Bloodsport III  Action|Thriller  1996

------------------------------------------------------------------------------
MovieId 92

    movieId        title                 genres
81       92  Mary Reilly  Drama|Horror|Thriller

Similar movies for MovieId 92 are:

      movieId        title                 genres  year
81         92  Mary Reilly  Drama|Horror|Thriller  1996
4670     6975  Funny Games  Drama|Horror|Thriller  1997
9616   180263  The Shining  Drama|Horror|Thriller  1997

------------------------------------------------------------------------------
MovieId 93

    movieId                title                 genres
82       93  Vampire in Brooklyn  Comedy|Horror|Romance

Similar movies for MovieId 93 are:

      movieId               title                 genres  year
5507    26429  Love at First Bite  Comedy|Horror|Romance  1979
5998    37444     Frankenstein 90  Comedy|Horror|Romance  1984
8034    98175               Vamps  Comedy|Horror|Romance  2012

------------------------------------------------------------------------------
MovieId 94

    movieId            title                genres
83       94  Beautiful Girls  Comedy|Drama|Romance

Similar movies for MovieId 94 are:

      movieId                         title                genres  year
650       838                          Emma  Comedy|Drama|Romance  1996
658       852                       Tin Cup  Comedy|Drama|Romance  1996
5598    26928  Summer's Tale, A Conte d'été  Comedy|Drama|Romance  1996

------------------------------------------------------------------------------
MovieId 95

    movieId         title                     genres
84       95  Broken Arrow  Action|Adventure|Thriller

Similar movies for MovieId 95 are:

     movieId         title                     genres  year
84        95  Broken Arrow  Action|Adventure|Thriller  1996
592      733     Rock, The  Action|Adventure|Thriller  1996
754      990  Maximum Risk  Action|Adventure|Thriller  1996

------------------------------------------------------------------------------
MovieId 96

    movieId                   title        genres
85       96  In the Bleak Midwinter  Comedy|Drama

Similar movies for MovieId 96 are:

     movieId                   title        genres  year
74        82  Antonia's Line Antonia  Comedy|Drama  1995
129      156        Blue in the Face  Comedy|Drama  1995
281      322    Swimming with Sharks  Comedy|Drama  1995

------------------------------------------------------------------------------
MovieId 97

    movieId           title       genres
86       97  Hate Haine, La  Crime|Drama

Similar movies for MovieId 97 are:

     movieId                                        title       genres  year
29        30  Shanghai Triad Yao a yao yao dao waipo qiao  Crime|Drama  1995
86        97                               Hate Haine, La  Crime|Drama  1995
102      117               Young Poisoner's Handbook, The  Crime|Drama  1995

------------------------------------------------------------------------------
MovieId 99

    movieId                          title       genres
87       99  Heidi Fleiss: Hollywood Madam  Documentary

Similar movies for MovieId 99 are:

     movieId                          title       genres  year
87        99  Heidi Fleiss: Hollywood Madam  Documentary  1995
101      116          Anne Frank Remembered  Documentary  1995
174      206                       Unzipped  Documentary  1995

------------------------------------------------------------------------------
MovieId 100

    movieId      title          genres
88      100  City Hall  Drama|Thriller

Similar movies for MovieId 100 are:

      movieId          title          genres  year
88        100      City Hall  Drama|Thriller  1996
252       291  Poison Ivy II  Drama|Thriller  1996
1133     1483          Crash  Drama|Thriller  1996

------------------------------------------------------------------------------
MovieId 101

    movieId          title                          genres
89      101  Bottle Rocket  Adventure|Comedy|Crime|Romance

Similar movies for MovieId 101 are:

      movieId                  title                          genres  year
1146     1500    Grosse Pointe Blank            Comedy|Crime|Romance  1997
1383     1894  Six Days Seven Nights        Adventure|Comedy|Romance  1998
7032    68848    Brothers Bloom, The  Adventure|Comedy|Crime|Romance  2008

------------------------------------------------------------------------------
MovieId 102

    movieId      title  genres
90      102  Mr. Wrong  Comedy

Similar movies for MovieId 102 are:

      movieId                       title  genres  year
1089     1414                      Mother  Comedy  1996
1153     1516  Children of the Revolution  Comedy  1996
1188     1585               Love Serenade  Comedy  1996

------------------------------------------------------------------------------
MovieId 103

    movieId          title                   genres
91      103  Unforgettable  Mystery|Sci-Fi|Thriller

Similar movies for MovieId 103 are:

      movieId                             title                   genres  year
31         32  Twelve Monkeys a.k.a. 12 Monkeys  Mystery|Sci-Fi|Thriller  1995
7089    70286                        District 9  Mystery|Sci-Fi|Thriller  2009
9074   143255                        Narcopolis  Mystery|Sci-Fi|Thriller  2014

------------------------------------------------------------------------------
MovieId 104

    movieId          title  genres
92      104  Happy Gilmore  Comedy

Similar movies for MovieId 104 are:

      movieId                       title  genres  year
1089     1414                      Mother  Comedy  1996
1153     1516  Children of the Revolution  Comedy  1996
1188     1585               Love Serenade  Comedy  1996

------------------------------------------------------------------------------
MovieId 105

    movieId                           title         genres
93      105  Bridges of Madison County, The  Drama|Romance

Similar movies for MovieId 105 are:

     movieId                  title         genres  year
16        17  Sense and Sensibility  Drama|Romance  1995
45        49  When Night Is Falling  Drama|Romance  1995
170      202          Total Eclipse  Drama|Romance  1995

------------------------------------------------------------------------------
MovieId 106

    movieId                              title        genres
94      106  Nobody Loves Me Keiner liebt mich  Comedy|Drama

Similar movies for MovieId 106 are:

     movieId                   title        genres  year
451      516         Renaissance Man  Comedy|Drama  1994
496      574     Spanking the Monkey  Comedy|Drama  1994
502      583  Dear Diary Caro Diario  Comedy|Drama  1994

------------------------------------------------------------------------------
MovieId 107

    movieId                   title                             genres
95      107  Muppet Treasure Island  Adventure|Children|Comedy|Musical

Similar movies for MovieId 107 are:

,movieId,title,genres,year
1052,1367,101 Dalmatians,Adventure|Children|Comedy,1996
1177,1566,Hercules,Adventure|Animation|Children|Comedy|Musical,1997
2536,3396,"Muppet Movie, The",Adventure|Children|Comedy|Musical,1979

------------------------------------------------------------------------------
MovieId 108

    movieId    title       genres
96      108  Catwalk  Documentary

Similar movies for MovieId 108 are:

     movieId                                          title       genres  year
96       108                                        Catwalk  Documentary  1996
844     1111  Microcosmos Microcosmos: Le peuple de l'herbe  Documentary  1996
867     1147                             When We Were Kings  Documentary  1996

------------------------------------------------------------------------------
MovieId 110

    movieId       title            genres
97      110  Braveheart  Action|Drama|War

Similar movies for MovieId 110 are:

      movieId                title            genres  year
1503     2028  Saving Private Ryan  Action|Drama|War  1998
1826     2427   Thin Red Line, The  Action|Drama|War  1998
2808     3753         Patriot, The  Action|Drama|War  2000

------------------------------------------------------------------------------
MovieId 111

    movieId        title                genres
98      111  Taxi Driver  Crime|Drama|Thriller

Similar movies for MovieId 111 are:

      movieId                                title                genres  year
2653     3551                         Marathon Man  Crime|Drama|Thriller  1976
2799     3741                             Badlands  Crime|Drama|Thriller  1973
5050     7895  Bring Me the Head of Alfredo Garcia  Crime|Drama|Thriller  1974

------------------------------------------------------------------------------
MovieId 112

    movieId                              title                         genres
99      112  Rumble in the Bronx Hont faan kui  Action|Adventure|Comedy|Crime

Similar movies for MovieId 112 are:

      movieId            title                         genres  year
126       153   Batman Forever  Action|Adventure|Comedy|Crime  1995
4071     5803            I Spy  Action|Adventure|Comedy|Crime  2002
4726     7048  Nothing to Lose  Action|Adventure|Comedy|Crime  1997

------------------------------------------------------------------------------